maxgerhardt/pio-avr32dd14-test/custom_packages/toolchain-atmelavr-windows/avr/include/avr/io90pwm3.h
#define ICR1L   _SFR_MEM8(0x86)
#define ICR10   0
#define ICR11   1
#define ICR12   2
#define ICR13   3
#define ICR14   4
#define ICR15   5
#define ICR16   6
#define ICR17   7
#define ICR1H   _SFR_MEM8(0x87)
#define ICR18   0
#define ICR19   1
#define ICR110  2
#define ICR111  3
#define ICR112  4
#define ICR113  5
#define ICR114  6
#define ICR115  7

/* Combine OCR1AL and OCR1AH */
#define OCR1A   _SFR_MEM16(0x88)

#define OCR1AL  _SFR_MEM8(0x88)
#define OCR1A0  0
#define OCR1A1  1
#define OCR1A2  2
#define OCR1A3  3
#define OCR1A4  4
#define OCR1A5  5
#define OCR1A6  6
#define OCR1A7  7
#define OCR1AH  _SFR_MEM8(0x89)
#define OCR1A8  0
#define OCR1A9  1
#define OCR1A10 2
#define OCR1A11 3
#define OCR1A12 4
#define OCR1A13 5
#define OCR1A14 6
#define OCR1A15 7

/* Combine OCR1BL and OCR1BH */
#define OCR1B   _SFR_MEM16(0x8A)

#define OCR1BL  _SFR_MEM8(0x8A)
#define OCR1B0  0
#define OCR1B1  1
#define OCR1B2  2
#define OCR1B3  3
#define OCR1B4  4
#define OCR1B5  5
#define OCR1B6  6
#define OCR1B7  7
#define OCR1BH  _SFR_MEM8(0x8B)
#define OCR1B8  0
#define OCR1B9  1
#define OCR1B10 2
#define OCR1B11 3
#define OCR1B12 4
#define OCR1B13 5
#define OCR1B14 6
#define OCR1B15 7

/* Reserved [0x8C..0x9F] */

#define PIFR0   _SFR_MEM8(0xA0)
#define PEOP0   0
#define PRN00   1
#define PRN01   2
#define PEV0A   3
#define PEV0B   4
#define PSEI0   5

#define PIM0    _SFR_MEM8(0xA1)
#define PEOPE0  0
#define PEVE0A  3
#define PEVE0B  4
#define PSEIE0  5

#define PIFR1   _SFR_MEM8(0xA2)
#define PEOP1   0
#define PRN10   1
#define PRN11   2
#define PEV1A   3
#define PEV1B   4
#define PSEI1   5

#define PIM1    _SFR_MEM8(0xA3)
#define PEOPE1  0
#define PEVE1A  3
#define PEVE1B  4
#define PSEIE1  5

#define PIFR2   _SFR_MEM8(0xA4)
#define PEOP2   0
#define PRN20   1
#define PRN21   2
#define PEV2A   3
#define PEV2B   4
#define PSEI2   5

#define PIM2    _SFR_MEM8(0xA5)
#define PEOPE2  0
#define PEVE2A  3
#define PEVE2B  4
#define PSEIE2  5

/* Reserved [0xA6..0xA9] */

#define DACON   _SFR_MEM8(0xAA)
#define DAEN    0
#define DAOE    1
#define DALA    2
#define DATS0   4
#define DATS1   5
#define DATS2   6
#define DAATE   7

/* Combine DACL and DACH */
#define DAC     _SFR_MEM16(0xAB)

#define DACL    _SFR_MEM8(0xAB)
#define DAC0    0
#define DAC1    1
#define DAC2    2
#define DAC3    3
#define DAC4    4
#define DAC5    5
#define DAC6    6
#define DAC7    7
#define DACH    _SFR_MEM8(0xAC)
#define DAC8    0
#define DAC9    1
#define DAC10   2
#define DAC11   3
#define DAC12   4
#define DAC13   5
#define DAC14   6
#define DAC15   7

#define AC0CON  _SFR_MEM8(0xAD)
#define AC0M0   0
#define AC0M1   1
#define AC0M2   2
#define AC0IS0  4
#define AC0IS1  5
#define AC0IE   6
#define AC0EN   7

#define AC1CON  _SFR_MEM8(0xAE)
#define AC1M0   0
#define AC1M1   1
#define AC1M2   2
#define AC1ICE  3
#define AC1IS0  4
#define AC1IS1  5
#define AC1IE   6
#define AC1EN   7

#define AC2CON  _SFR_MEM8(0xAF)
#define AC2M0   0
#define AC2M1   1
#define AC2M2   2
#define AC2IS0  4
#define AC2IS1  5
#define AC2IE   6
#define AC2EN   7

/* Reserved [0xB0..0xBF] */

#define UCSRA   _SFR_MEM8(0xC0)
#define MPCM    0
#define U2X     1
#define UPE     2
#define DOR     3
#define FE      4
#define UDRE    5
#define TXC     6
#define RXC     7

#define UCSRB   _SFR_MEM8(0xC1)
#define TXB8    0
#define RXB8    1
#define UCSZ2   2
#define TXEN    3
#define RXEN    4
#define UDRIE   5
#define TXCIE   6
#define RXCIE   7

#define UCSRC   _SFR_MEM8(0xC2)
#define UCPOL   0
#define UCSZ0   1
#define UCSZ1   2
#define USBS    3
#define UPM0    4
#define UPM1    5
#define UMSEL0  6

/* Reserved [0xC3] */

/* Combine UBRRL and UBRRH */
#define UBRR    _SFR_MEM16(0xC4)

#define UBRRL   _SFR_MEM8(0xC4)
#define UBRR0   0
#define UBRR1   1
#define UBRR2   2
#define UBRR3   3
#define UBRR4   4
#define UBRR5   5
#define UBRR6   6
#define UBRR7   7
#define UBRRH   _SFR_MEM8(0xC5)
#define UBRR8   0
#define UBRR9   1
#define UBRR10  2
#define UBRR11  3

#define UDR     _SFR_MEM8(0xC6)
#define UDR0    0
#define UDR1    1
#define UDR2    2
#define UDR3    3
#define UDR4    4
#define UDR5    5
#define UDR6    6
#define UDR7    7

/* Reserved [0xC7] */

#define EUCSRA  _SFR_MEM8(0xC8)
#define URxS0   0
#define URxS1   1
#define URxS2   2
#define URxS3   3
#define UTxS0   4
#define UTxS1   5
#define UTxS2   6
#define UTxS3   7

#define EUCSRB  _SFR_MEM8(0xC9)
#define BODR    0
#define EMCH    1
#define EUSBS   3
#define EUSART  4

#define EUCSRC  _SFR_MEM8(0xCA)
#define STP0    0
#define STP1    1
#define F1617   2
#define FEM     3

/* Reserved [0xCB] */

/* Combine MUBRRL and MUBRRH */
#define MUBRR   _SFR_MEM16(0xCC)

#define MUBRRL  _SFR_MEM8(0xCC)
#define MUBRR0  0
#define MUBRR1  1
#define MUBRR2  2
#define MUBRR3  3
#define MUBRR4  4
#define MUBRR5  5
#define MUBRR6  6
#define MUBRR7  7
#define MUBRRH  _SFR_MEM8(0xCD)
#define MUBRR8  0
#define MUBRR9  1
#define MUBRR10 2
#define MUBRR11 3
#define MUBRR12 4
#define MUBRR13 5
#define MUBRR14 6
#define MUBRR15 7

#define EUDR    _SFR_MEM8(0xCE)
#define EUDR0   0
#define EUDR1   1
#define EUDR2   2
#define EUDR3   3
#define EUDR4   4
#define EUDR5   5
#define EUDR6   6
#define EUDR7   7

/* Reserved [0xCF] */

#define PSOC0   _SFR_MEM8(0xD0)
#define POEN0A  0
#define POEN0B  2
#define PSYNC00 4
#define PSYNC01 5

/* Reserved [0xD1] */

/* Combine OCR0SAL and OCR0SAH */
#define OCR0SA  _SFR_MEM16(0xD2)

#define OCR0SAL _SFR_MEM8(0xD2)
#define OCR0SA0 0
#define OCR0SA1 1
#define OCR0SA2 2
#define OCR0SA3 3
#define OCR0SA4 4
#define OCR0SA5 5
#define OCR0SA6 6
#define OCR0SA7 7
#define OCR0SAH _SFR_MEM8(0xD3)
#define OCR0SA8 0
#define OCR0SA9 1
#define OCR0SA10 2
#define OCR0SA11 3

/* Combine OCR0RAL and OCR0RAH */
#define OCR0RA  _SFR_MEM16(0xD4)

#define OCR0RAL _SFR_MEM8(0xD4)
#define OCR0RA0 0
#define OCR0RA1 1
#define OCR0RA2 2
#define OCR0RA3 3
#define OCR0RA4 4
#define OCR0RA5 5
#define OCR0RA6 6
#define OCR0RA7 7
#define OCR0RAH _SFR_MEM8(0xD5)
#define OCR0RA8 0
#define OCR0RA9 1
#define OCR0RA10 2
#define OCR0RA11 3

/* Combine OCR0SBL and OCR0SBH */
#define OCR0SB  _SFR_MEM16(0xD6)

