maxgerhardt/pio-avr32dd14-test/custom_packages/toolchain-atmelavr-windows/avr/include/avr/io90pwm3.h
#define OCR0SBL _SFR_MEM8(0xD6)
#define OCR0SB0 0
#define OCR0SB1 1
#define OCR0SB2 2
#define OCR0SB3 3
#define OCR0SB4 4
#define OCR0SB5 5
#define OCR0SB6 6
#define OCR0SB7 7
#define OCR0SBH _SFR_MEM8(0xD7)
#define OCR0SB8 0
#define OCR0SB9 1
#define OCR0SB10 2
#define OCR0SB11 3

/* Combine OCR0RBL and OCR0RBH */
#define OCR0RB  _SFR_MEM16(0xD8)

#define OCR0RBL _SFR_MEM8(0xD8)
#define OCR0RB0 0
#define OCR0RB1 1
#define OCR0RB2 2
#define OCR0RB3 3
#define OCR0RB4 4
#define OCR0RB5 5
#define OCR0RB6 6
#define OCR0RB7 7
#define OCR0RBH _SFR_MEM8(0xD9)
#define OCR0RB8 0
#define OCR0RB9 1
#define OCR0RB10 2
#define OCR0RB11 3
#define OCR0RB12 4
#define OCR0RB13 5
#define OCR0RB14 6
#define OCR0RB15 7

#define PCNF0   _SFR_MEM8(0xDA)
#define PCLKSEL0 1
#define POP0    2
#define PMODE00 3
#define PMODE01 4
#define PLOCK0  5
#define PALOCK0 6
#define PFIFTY0 7

#define PCTL0   _SFR_MEM8(0xDB)
#define PRUN0   0
#define PCCYC0  1
#define PARUN0  2
#define PAOC0A  3
#define PAOC0B  4
#define PBFM0   5
#define PPRE00  6
#define PPRE01  7

#define PFRC0A  _SFR_MEM8(0xDC)
#define PRFM0A0 0
#define PRFM0A1 1
#define PRFM0A2 2
#define PRFM0A3 3
#define PFLTE0A 4
#define PELEV0A 5
#define PISEL0A 6
#define PCAE0A  7

#define PFRC0B  _SFR_MEM8(0xDD)
#define PRFM0B0 0
#define PRFM0B1 1
#define PRFM0B2 2
#define PRFM0B3 3
#define PFLTE0B 4
#define PELEV0B 5
#define PISEL0B 6
#define PCAE0B  7

/* Combine PICR0L and PICR0H */
#define PICR0   _SFR_MEM16(0xDE)

#define PICR0L  _SFR_MEM8(0xDE)
#define PICR00  0
#define PICR01  1
#define PICR02  2
#define PICR03  3
#define PICR04  4
#define PICR05  5
#define PICR06  6
#define PICR07  7
#define PICR0H  _SFR_MEM8(0xDF)
#define PICR08  0
#define PICR09  1
#define PICR010 2
#define PICR011 3

#define PSOC1   _SFR_MEM8(0xE0)
#define POEN1A  0
#define POEN1B  2
#define PSYNC1_0 4
#define PSYNC1_1 5

/* Reserved [0xE1] */

/* Combine OCR1SAL and OCR1SAH */
#define OCR1SA  _SFR_MEM16(0xE2)

#define OCR1SAL _SFR_MEM8(0xE2)
#define OCR1SAH _SFR_MEM8(0xE3)

/* Combine OCR1RAL and OCR1RAH */
#define OCR1RA  _SFR_MEM16(0xE4)

#define OCR1RAL _SFR_MEM8(0xE4)
#define OCR1RAH _SFR_MEM8(0xE5)

/* Combine OCR1SBL and OCR1SBH */
#define OCR1SB  _SFR_MEM16(0xE6)

#define OCR1SBL _SFR_MEM8(0xE6)
#define OCR1SBH _SFR_MEM8(0xE7)

/* Combine OCR1RBL and OCR1RBH */
#define OCR1RB  _SFR_MEM16(0xE8)

#define OCR1RBL _SFR_MEM8(0xE8)
#define OCR1RBH _SFR_MEM8(0xE9)

#define PCNF1   _SFR_MEM8(0xEA)
#define PCLKSEL1 1
#define POP1    2
#define PMODE10 3
#define PMODE11 4
#define PLOCK1  5
#define PALOCK1 6
#define PFIFTY1 7

#define PCTL1   _SFR_MEM8(0xEB)
#define PRUN1   0
#define PCCYC1  1
#define PARUN1  2
#define PAOC1A  3
#define PAOC1B  4
#define PBFM1   5
#define PPRE10  6
#define PPRE11  7

#define PFRC1A  _SFR_MEM8(0xEC)
#define PRFM1A0 0
#define PRFM1A1 1
#define PRFM1A2 2
#define PRFM1A3 3
#define PFLTE1A 4
#define PELEV1A 5
#define PISEL1A 6
#define PCAE1A  7

#define PFRC1B  _SFR_MEM8(0xED)
#define PRFM1B0 0
#define PRFM1B1 1
#define PRFM1B2 2
#define PRFM1B3 3
#define PFLTE1B 4
#define PELEV1B 5
#define PISEL1B 6
#define PCAE1B  7

/* Combine PICR1L and PICR1H */
#define PICR1   _SFR_MEM16(0xEE)

#define PICR1L  _SFR_MEM8(0xEE)
#define PICR1H  _SFR_MEM8(0xEF)

#define PSOC2   _SFR_MEM8(0xF0)
#define POEN2A  0
#define POEN2C  1
#define POEN2B  2
#define POEN2D  3
#define PSYNC2_0 4
#define PSYNC2_1 5
#define POS22   6
#define POS23   7

#define POM2    _SFR_MEM8(0xF1)
#define POMV2A0 0
#define POMV2A1 1
#define POMV2A2 2
#define POMV2A3 3
#define POMV2B0 4
#define POMV2B1 5
#define POMV2B2 6
#define POMV2B3 7

/* Combine OCR2SAL and OCR2SAH */
#define OCR2SA  _SFR_MEM16(0xF2)

#define OCR2SAL _SFR_MEM8(0xF2)
#define OCR2SA0 0
#define OCR2SA1 1
#define OCR2SA2 2
#define OCR2SA3 3
#define OCR2SA4 4
#define OCR2SA5 5
#define OCR2SA6 6
#define OCR2SA7 7
#define OCR2SAH _SFR_MEM8(0xF3)
#define OCR2SA8 0
#define OCR2SA9 1
#define OCR2SA10 2
#define OCR2SA11 3

/* Combine OCR2RAL and OCR2RAH */
#define OCR2RA  _SFR_MEM16(0xF4)

#define OCR2RAL _SFR_MEM8(0xF4)
#define OCR2RA0 0
#define OCR2RA1 1
#define OCR2RA2 2
#define OCR2RA3 3
#define OCR2RA4 4
#define OCR2RA5 5
#define OCR2RA6 6
#define OCR2RA7 7
#define OCR2RAH _SFR_MEM8(0xF5)
#define OCR2RA8 0
#define OCR2RA9 1
#define OCR2RA10 2
#define OCR2RA11 3

/* Combine OCR2SBL and OCR2SBH */
#define OCR2SB  _SFR_MEM16(0xF6)

#define OCR2SBL _SFR_MEM8(0xF6)
#define OCR2SB0 0
#define OCR2SB1 1
#define OCR2SB2 2
#define OCR2SB3 3
#define OCR2SB4 4
#define OCR2SB5 5
#define OCR2SB6 6
#define OCR2SB7 7
#define OCR2SBH _SFR_MEM8(0xF7)
#define OCR2SB8 0
#define OCR2SB9 1
#define OCR2SB10 2
#define OCR2SB11 3

/* Combine OCR2RBL and OCR2RBH */
#define OCR2RB  _SFR_MEM16(0xF8)

#define OCR2RBL _SFR_MEM8(0xF8)
#define OCR2RB0 0
#define OCR2RB1 1
#define OCR2RB2 2
#define OCR2RB3 3
#define OCR2RB4 4
#define OCR2RB5 5
#define OCR2RB6 6
#define OCR2RB7 7
#define OCR2RBH _SFR_MEM8(0xF9)
#define OCR2RB8 0
#define OCR2RB9 1
#define OCR2RB10 2
#define OCR2RB11 3
#define OCR2RB12 4
#define OCR2RB13 5
#define OCR2RB14 6
#define OCR2RB15 7

#define PCNF2   _SFR_MEM8(0xFA)
#define POME2   0
#define PCLKSEL2 1
#define POP2    2
#define PMODE20 3
#define PMODE21 4
#define PLOCK2  5
#define PALOCK2 6
#define PFIFTY2 7

#define PCTL2   _SFR_MEM8(0xFB)
#define PRUN2   0
#define PCCYC2  1
#define PARUN2  2
#define PAOC2A  3
#define PAOC2B  4
#define PBFM2   5
#define PPRE20  6
#define PPRE21  7

#define PFRC2A  _SFR_MEM8(0xFC)
#define PRFM2A0 0
#define PRFM2A1 1
#define PRFM2A2 2
#define PRFM2A3 3
#define PFLTE2A 4
#define PELEV2A 5
#define PISEL2A 6
#define PCAE2A  7

#define PFRC2B  _SFR_MEM8(0xFD)
#define PRFM2B0 0
#define PRFM2B1 1
#define PRFM2B2 2
#define PRFM2B3 3
#define PFLTE2B 4
#define PELEV2B 5
#define PISEL2B 6
#define PCAE2B  7

/* Combine PICR2L and PICR2H */
#define PICR2   _SFR_MEM16(0xFE)

#define PICR2L  _SFR_MEM8(0xFE)
#define PICR20  0
#define PICR21  1
#define PICR22  2
#define PICR23  3
#define PICR24  4
#define PICR25  5
#define PICR26  6
#define PICR27  7
#define PICR2H  _SFR_MEM8(0xFF)
#define PICR28  0
#define PICR29  1
#define PICR210 2
#define PICR211 3



