maxgerhardt/pio-avr32dd14-test/custom_packages/toolchain-atmelavr-windows/avr/include/avr/io90pwm3.h
/* Values and associated defines */


#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_ADC (0x01<<1)
#define SLEEP_MODE_PWR_DOWN (0x02<<1)
#define SLEEP_MODE_STANDBY (0x06<<1)

/* Interrupt vectors */
/* Vector 0 is the reset vector */
/* PSC2 Capture Event */
#define PSC2_CAPT_vect            _VECTOR(1)
#define PSC2_CAPT_vect_num        1

/* PSC2 End Cycle */
#define PSC2_EC_vect            _VECTOR(2)
#define PSC2_EC_vect_num        2

/* PSC1 Capture Event */
#define PSC1_CAPT_vect            _VECTOR(3)
#define PSC1_CAPT_vect_num        3

/* PSC1 End Cycle */
#define PSC1_EC_vect            _VECTOR(4)
#define PSC1_EC_vect_num        4

/* PSC0 Capture Event */
#define PSC0_CAPT_vect            _VECTOR(5)
#define PSC0_CAPT_vect_num        5

/* PSC0 End Cycle */
#define PSC0_EC_vect            _VECTOR(6)
#define PSC0_EC_vect_num        6

/* Analog Comparator 0 */
#define ANALOG_COMP_0_vect            _VECTOR(7)
#define ANALOG_COMP_0_vect_num        7

/* Analog Comparator 1 */
#define ANALOG_COMP_1_vect            _VECTOR(8)
#define ANALOG_COMP_1_vect_num        8

/* Analog Comparator 2 */
#define ANALOG_COMP_2_vect            _VECTOR(9)
#define ANALOG_COMP_2_vect_num        9

/* External Interrupt Request 0 */
#define INT0_vect            _VECTOR(10)
#define INT0_vect_num        10

/* Timer/Counter1 Capture Event */
#define TIMER1_CAPT_vect            _VECTOR(11)
#define TIMER1_CAPT_vect_num        11

/* Timer/Counter1 Compare Match A */
#define TIMER1_COMPA_vect            _VECTOR(12)
#define TIMER1_COMPA_vect_num        12

/* Timer/Counter Compare Match B */
#define TIMER1_COMPB_vect            _VECTOR(13)
#define TIMER1_COMPB_vect_num        13

/*  */
#define RESERVED15_vect            _VECTOR(14)
#define RESERVED15_vect_num        14

/* Timer/Counter1 Overflow */
#define TIMER1_OVF_vect            _VECTOR(15)
#define TIMER1_OVF_vect_num        15

/* Timer/Counter0 Compare Match A */
#define TIMER0_COMPA_vect            _VECTOR(16)
#define TIMER0_COMPA_vect_num        16

/* Timer/Counter0 Overflow */
#define TIMER0_OVF_vect            _VECTOR(17)
#define TIMER0_OVF_vect_num        17

/* ADC Conversion Complete */
#define ADC_vect            _VECTOR(18)
#define ADC_vect_num        18

/* External Interrupt Request 1 */
#define INT1_vect            _VECTOR(19)
#define INT1_vect_num        19

/* SPI Serial Transfer Complete */
#define SPI_STC_vect            _VECTOR(20)
#define SPI_STC_vect_num        20

/* USART, Rx Complete */
#define USART_RX_vect            _VECTOR(21)
#define USART_RX_vect_num        21

/* USART Data Register Empty */
#define USART_UDRE_vect            _VECTOR(22)
#define USART_UDRE_vect_num        22

/* USART, Tx Complete */
#define USART_TX_vect            _VECTOR(23)
#define USART_TX_vect_num        23

/* External Interrupt Request 2 */
#define INT2_vect            _VECTOR(24)
#define INT2_vect_num        24

/* Watchdog Timeout Interrupt */
#define WDT_vect            _VECTOR(25)
#define WDT_vect_num        25

/* EEPROM Ready */
#define EE_READY_vect            _VECTOR(26)
#define EE_READY_vect_num        26

/* Timer Counter 0 Compare Match B */
#define TIMER0_COMPB_vect            _VECTOR(27)
#define TIMER0_COMPB_vect_num        27

/* External Interrupt Request 3 */
#define INT3_vect            _VECTOR(28)
#define INT3_vect_num        28

/*  */
#define RESERVED30_vect            _VECTOR(29)
#define RESERVED30_vect_num        29

/*  */
#define RESERVED31_vect            _VECTOR(30)
#define RESERVED31_vect_num        30

/* Store Program Memory Read */
#define SPM_READY_vect            _VECTOR(31)
#define SPM_READY_vect_num        31

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define _VECTORS_SIZE 64
#else
#  define _VECTORS_SIZE 64U
#endif


/* Constants */

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define SPM_PAGESIZE 64
#  define FLASHSTART   0x0000
#  define FLASHEND     0x1FFF
#else
#  define SPM_PAGESIZE 64U
#  define FLASHSTART   0x0000U
#  define FLASHEND     0x1FFFU
#endif
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define RAMSTART     0x0100
#  define RAMSIZE      512
#  define RAMEND       0x02FF
#else
#  define RAMSTART     0x0100U
#  define RAMSIZE      512U
#  define RAMEND       0x02FFU
#endif
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define E2START     0
#  define E2SIZE      512
#  define E2PAGESIZE  4
#  define E2END       0x01FF
#else
#  define E2START     0U
#  define E2SIZE      512U
#  define E2PAGESIZE  4U
#  define E2END       0x01FFU
#endif
#define XRAMEND      RAMEND


/* Fuses */

#define FUSE_MEMORY_SIZE 3

/* Low Fuse Byte */
#define FUSE_SUT_CKSEL0  (unsigned char)~_BV(0)
#define FUSE_SUT_CKSEL1  (unsigned char)~_BV(1)
#define FUSE_SUT_CKSEL2  (unsigned char)~_BV(2)
#define FUSE_SUT_CKSEL3  (unsigned char)~_BV(3)
#define FUSE_SUT_CKSEL4  (unsigned char)~_BV(4)
#define FUSE_SUT_CKSEL5  (unsigned char)~_BV(5)
#define FUSE_CKOUT       (unsigned char)~_BV(6)
#define FUSE_CKDIV8      (unsigned char)~_BV(7)
#define LFUSE_DEFAULT    (FUSE_SUT_CKSEL0 & FUSE_SUT_CKSEL2 & FUSE_SUT_CKSEL3 & FUSE_SUT_CKSEL4 & FUSE_CKDIV8)


/* High Fuse Byte */
#define FUSE_BODLEVEL0   (unsigned char)~_BV(0)
#define FUSE_BODLEVEL1   (unsigned char)~_BV(1)
#define FUSE_BODLEVEL2   (unsigned char)~_BV(2)
#define FUSE_EESAVE      (unsigned char)~_BV(3)
#define FUSE_WDTON       (unsigned char)~_BV(4)
#define FUSE_SPIEN       (unsigned char)~_BV(5)
#define FUSE_DWEN        (unsigned char)~_BV(6)
#define FUSE_RSTDISBL    (unsigned char)~_BV(7)
#define HFUSE_DEFAULT    (FUSE_SPIEN)


/* Extended Fuse Byte */
#define FUSE_BOOTRST     (unsigned char)~_BV(0)
#define FUSE_BOOTSZ0     (unsigned char)~_BV(1)
#define FUSE_BOOTSZ1     (unsigned char)~_BV(2)
#define FUSE_PSCRV       (unsigned char)~_BV(4)
#define FUSE_PSC0RB      (unsigned char)~_BV(5)
#define FUSE_PSC1RB      (unsigned char)~_BV(6)
#define FUSE_PSC2RB      (unsigned char)~_BV(7)
#define EFUSE_DEFAULT    (FUSE_BOOTSZ0 & FUSE_BOOTSZ1)



/* Lock Bits */
#define __LOCK_BITS_EXIST
#define __BOOT_LOCK_BITS_0_EXIST
#define __BOOT_LOCK_BITS_1_EXIST


/* Signature */
#define SIGNATURE_0 0x1E
#define SIGNATURE_1 0x93
#define SIGNATURE_2 0x81




#endif /* #ifdef _AVR_AT90PWM3_H_INCLUDED */

